<a href="https://colab.research.google.com/github/kdstheace/Python-Study/blob/main/Day0329_Pandas_GroupBy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **GroupBy의 사용**
- SQL문의 groupby와 유사

In [ ]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [ ]:
data = DataFrame({
    '부서' : ["영업1팀", "영업1팀", "영업2팀", "해외영업팀", "해외영업팀","영업1팀",\
            "해외영업팀", "영업1팀", "해외영업팀", "영업2팀", "영업2팀", "해외영업팀"],
    '순위' : [1, 2, 1, 3, 2, 1, 1, 1, 3, 2, 1, 2],
    '연도' : [2014, 2015, 2016, 2014, 2017, 2015, 2014, 2019, 2017, 2016, 2015, 2015],
    '매출액' : [876, 788, 900, 670, 770, 910, 760, 980, 910, 800, 877, 788]

})
data

       부서  순위    연도  매출액
0    영업1팀   1  2014  876
1    영업1팀   2  2015  788
2    영업2팀   1  2016  900
3   해외영업팀   3  2014  670
4   해외영업팀   2  2017  770
5    영업1팀   1  2015  910
6   해외영업팀   1  2014  760
7    영업1팀   1  2019  980
8   해외영업팀   3  2017  910
9    영업2팀   2  2016  800
10   영업2팀   1  2015  877
11  해외영업팀   2  2015  788

In [ ]:
#부서별로 매출액의 합계를 구할 때.
data.groupby('부서')['매출액'].sum()

연도
2014    2306
2015    3363
2016    1700
2017    1680
2019     980
Name: 매출액, dtype: int64

In [ ]:
#연도별로 매출액의 합
data.groupby('연도')['매출액'].sum()

In [ ]:
#각 부서별로 특정 연도의 매출액의 합계를 구하시오.
data.groupby(['부서', '연도'])['매출액'].sum()

부서     연도
영업1팀   2014     876
       2015    1698
       2019     980
영업2팀   2015     877
       2016    1700
해외영업팀  2014    1430
       2015     788
       2017    1680
Name: 매출액, dtype: int64

In [ ]:
#(멀티인덱스)각 부서별로 특정 연도의 매출액의 합계를 구하시오.
grouped = data.groupby(['부서', '연도'])['매출액'].sum()
print(grouped)
grouped.index

부서     연도
영업1팀   2014     876
       2015    1698
       2019     980
영업2팀   2015     877
       2016    1700
해외영업팀  2014    1430
       2015     788
       2017    1680
Name: 매출액, dtype: int64

MultiIndex([( '영업1팀', 2014),
            ( '영업1팀', 2015),
            ( '영업1팀', 2019),
            ( '영업2팀', 2015),
            ( '영업2팀', 2016),
            ('해외영업팀', 2014),
            ('해외영업팀', 2015),
            ('해외영업팀', 2017)],
           names=['부서', '연도'])

In [ ]:
grouped['해외영업팀']

연도
2014    1430
2015     788
2017    1680
Name: 매출액, dtype: int64

In [ ]:
grouped[['영업1팀','영업2팀']]

부서    연도
영업1팀  2014     876
      2015    1698
      2019     980
영업2팀  2015     877
      2016    1700
Name: 매출액, dtype: int64

In [ ]:
grouped['영업1팀':'해외영업팀']

부서     연도
영업1팀   2014     876
       2015    1698
       2019     980
영업2팀   2015     877
       2016    1700
해외영업팀  2014    1430
       2015     788
       2017    1680
Name: 매출액, dtype: int64

In [ ]:
grouped.unstack()

연도       2014    2015    2016    2017   2019
부서
영업1팀    876.0  1698.0     NaN     NaN  980.0
영업2팀      NaN   877.0  1700.0     NaN    NaN
해외영업팀  1430.0   788.0     NaN  1680.0    NaN

In [ ]:
#NaN을 전부 0으로 처리하자
updated = grouped.unstack().fillna(0)

# **Aggregation**

In [ ]:
grouped2 = data.groupby('부서')
for name, group in grouped2:
  print(name)
  print(group)

영업1팀
     부서  순위    연도  매출액
0  영업1팀   1  2014  876
1  영업1팀   2  2015  788
5  영업1팀   1  2015  910
7  영업1팀   1  2019  980
영업2팀
      부서  순위    연도  매출액
2   영업2팀   1  2016  900
9   영업2팀   2  2016  800
10  영업2팀   1  2015  877
해외영업팀
       부서  순위    연도  매출액
3   해외영업팀   3  2014  670
4   해외영업팀   2  2017  770
6   해외영업팀   1  2014  760
8   해외영업팀   3  2017  910
11  해외영업팀   2  2015  788

In [ ]:
grouped2.agg([np.sum, np.mean])

       순위               연도                매출액
      sum      mean    sum         mean   sum   mean
부서
영업1팀    5  1.250000   8063  2015.750000  3554  888.5
영업2팀    4  1.333333   6047  2015.666667  2577  859.0
해외영업팀  11  2.200000  10077  2015.400000  3898  779.6

In [ ]:
data.groupby('부서')['매출액'].sum()

부서
영업1팀     3554
영업2팀     2577
해외영업팀    3898
Name: 매출액, dtype: int64

In [ ]:
data.groupby('부서')['매출액'].agg(np.sum)

부서
영업1팀     3554
영업2팀     2577
해외영업팀    3898
Name: 매출액, dtype: int64

In [ ]:
#filter와 함께 사용하기.
data.groupby('부서').filter(lambda x : len(x) > 3) #행의 갯수가 3개 이상인 데이터 출력

       부서  순위    연도  매출액
0    영업1팀   1  2014  876
1    영업1팀   2  2015  788
3   해외영업팀   3  2014  670
4   해외영업팀   2  2017  770
5    영업1팀   1  2015  910
6   해외영업팀   1  2014  760
7    영업1팀   1  2019  980
8   해외영업팀   3  2017  910
11  해외영업팀   2  2015  788

In [ ]:
#각 부서별로 매출액의 평균이 850이상인 데이터만 보자.
data.groupby('부서').filter(lambda x : x['매출액'].mean() > 850)

      부서  순위    연도  매출액
0   영업1팀   1  2014  876
1   영업1팀   2  2015  788
2   영업2팀   1  2016  900
5   영업1팀   1  2015  910
7   영업1팀   1  2019  980
9   영업2팀   2  2016  800
10  영업2팀   1  2015  877

In [ ]:
data.groupby('부서').filter(lambda x : x['매출액'].mean() > 880)
#data.groupby('부서')['매출액'].mean()랑 비교

     부서  순위    연도  매출액
0  영업1팀   1  2014  876
1  영업1팀   2  2015  788
5  영업1팀   1  2015  910
7  영업1팀   1  2019  980

In [ ]:
#2015년도 초과하는 연도별 데이터  결과
data.groupby('연도').filter(lambda x : x['연도'].min() > 2015)

      부서  순위    연도  매출액
2   영업2팀   1  2016  900
4  해외영업팀   2  2017  770
7   영업1팀   1  2019  980
8  해외영업팀   3  2017  910
9   영업2팀   2  2016  800

# **Pivot Table**
- Pandas에서 제공하는 Pivot기능은 엑셀의 피봇테이블과 동일한 기능을 제공한다.

In [58]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [51]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np

In [60]:
path = 'drive/MyDrive/Colab Notebooks/data/'

phone = pd.read_csv(path + 'phone_data.csv')
phone

     index            date  duration  item    month   network network_type
0        0  15/10/14 06:58    34.429  data  2014-11      data         data
1        1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2        2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3        3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4        4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile
..     ...             ...       ...   ...      ...       ...          ...
825    825  13/03/15 00:38     1.000   sms  2015-03     world        world
826    826  13/03/15 00:39     1.000   sms  2015-03  Vodafone       mobile
827    827  13/03/15 06:58    34.429  data  2015-03      data         data
828    828  14/03/15 00:13     1.000   sms  2015-03     world        world
829    829  14/03/15 00:16     1.000   sms  2015-03     world        world

[830 rows x 7 columns]

In [61]:
phone.pivot_table(['duration'], 
                  index=[phone.month, phone.item], 
                  columns = phone.network,
                  aggfunc = np.mean, #나타내고자 하는 agg연산 값
                  fill_value = 0 #크로스되는 부분에 아무 것도 없을때 뭐로 채울래
                  )

                duration                          ...
network           Meteor       Tesco       Three  ... special  voicemail world
month   item                                      ...
2014-11 call  117.000000  202.250000  319.435897  ...       0  50.166667     0
        data    0.000000    0.000000    0.000000  ...       0   0.000000     0
        sms     1.000000    1.000000    1.000000  ...       1   0.000000     0
2014-12 call  167.500000  151.583333  210.533333  ...       0  86.250000     0
        data    0.000000    0.000000    0.000000  ...       0   0.000000     0
        sms     1.000000    1.000000    1.000000  ...       0   0.000000     1
2015-01 call  105.095238  242.000000  247.884615  ...       0  95.000000     0
        data    0.000000    0.000000    0.000000  ...       0   0.000000     0
        sms     1.000000    1.000000    1.000000  ...       0   0.000000     0
2015-02 call  297.000000  204.350000  285.409091  ...       0  44.666667     0
        data    0.000000    0.000000    0.000000  ...       0   0.000000     0
        sms     1.000000    1.000000    1.000000  ...       1   0.000000     0
2015-03 call   68.500000  139.000000  451.454545  ...       0  57.750000     0
        data    0.000000    0.000000    0.000000  ...       0   0.000000     0
        sms     0.000000    1.000000    1.000000  ...       0   0.000000     1

[15 rows x 9 columns]

In [71]:
phone.pivot_table('duration', index=phone.item, columns=phone.network_type, aggfunc=np.sum, fill_value=0)

network_type     data  landline  mobile  special  voicemail  world
item
call             0.00     18433   72113        0       1775      0
data          5164.35         0       0        0          0      0
sms              0.00         0     282        3          0      7